# ╔══════════════════════════════════════════════════════════════════════════╗
# ║          YOLO11-GLD : intégration GL-CAB + MB-FPN                       ║
# ║  "Global-Local Attention Mechanism Based Small Object Detection"         ║
# ║  Bao Liu, Jinlei Huang — IEEE DDCLS 2023                                ║
# ╚══════════════════════════════════════════════════════════════════════════╝
#
# ┌─────────────────────────────────────────────────────────────────────────┐
# │  COMMENT LIRE CE FICHIER                                                │
# │                                                                         │
# │  Chaque ligne du backbone/head suit ce format :                         │
# │  [from, repeats, module, args]                                          │
# │                                                                         │
# │  • from    : indice de la couche source (-1 = couche précédente)        │
# │              Si liste → Ultralytics collecte plusieurs couches          │
# │  • repeats : nombre de fois que le module est répété                    │
# │  • module  : nom de la classe Python                                    │
# │  • args    : arguments passés au constructeur __init__                  │
# └─────────────────────────────────────────────────────────────────────────┘

nc: 1 # nombre de classes (à adapter à votre dataset)
ch: 16 # <- si tes images ont 16 canaux (sinon retire cette ligne)

scales:
  # [depth, width, max_channels]
  # depth  : multiplie le nombre de répétitions (repeats)
  # width  : multiplie le nombre de canaux
  n: [0.50, 0.25, 1024] # nano
  s: [0.50, 0.50, 1024] # small
  m: [0.50, 1.00, 512] # medium
  l: [1.00, 1.00, 512] # large
  x: [1.00, 1.50, 512] # xlarge

# ══════════════════════════════════════════════════════════════════════════════
# BACKBONE  —  extraction des features
# ══════════════════════════════════════════════════════════════════════════════
#
#  Rôle : descendre progressivement la résolution tout en augmentant
#         la richesse sémantique des features.
#
#  Résolution de sortie par layer (pour une entrée 640×640) :
#    Layer 0  →  320×320   (stride 2)
#    Layer 1  →  160×160   (stride 4)   P2
#    Layer 4  →   80×80    (stride 8)   P3  ← petits objects
#    Layer 6  →   40×40    (stride 16)  P4  ← objects moyens
#    Layer 9  →   20×20    (stride 32)  P5  ← grands objects
#
backbone:
  # [from, repeats, module, args]

  # ── Stem ──────────────────────────────────────────────────────────────────
  - [-1, 1, Conv, [64, 3, 2]] # 0 (k=3, s=2) ; c_in vient de `ch`
  - [-1, 1, Conv, [128, 3, 2]] # 1

  # ── Stage 1 ───────────────────────────────────────────────────────────────
  - [-1, 2, C3k2, [256, False, 0.25]] # 2         160×160   ch=256
  #   C3k2 = Cross Stage Partial avec 2 convolutions
  #   args: [out_channels, shortcut, expansion]

  - [-1, 1, Conv, [256, 3, 2]] # 3  P3/8    80×80    ch=256

  # ── Stage 2  — features P3 (petits objects) ────────────────────────────────
  - [-1, 2, C3k2, [512, False, 0.25]] # 4  P3      80×80    ch=512
  #   ▲ SAUVEGARDÉ — utilisé par MB-FPN (branche principale) et le head FPN

  - [-1, 1, Conv, [512, 3, 2]] # 5  P4/16   40×40    ch=512

  # ── Stage 3  — features P4 (objects moyens) ────────────────────────────────
  - [-1, 2, C3k2, [512, True]] # 6  P4      40×40    ch=512
  #   ▲ SAUVEGARDÉ — utilisé par MB-FPN et le head FPN

  - [-1, 1, Conv, [1024, 3, 2]] # 7  P5/32   20×20    ch=1024

  # ── Stage 4  — features P5 (grands objects / contexte global) ──────────────
  - [-1, 2, C3k2, [1024, True]] # 8          20×20    ch=1024

  # ── SPPF  —  Spatial Pyramid Pooling Fast ─────────────────────────────────
  - [-1, 1, SPPF, [1024, 5]] # 9  P5      20×20    ch=1024
  #   ▲ SAUVEGARDÉ — features P5 profondes (branche principale MB-FPN)
  #   SPPF agrège le contexte multi-échelle avec des max-poolings en cascade

  # ── GL-CAB  —  Global-Local Combined Attention Block ──────────────────────
  - [-1, 1, GLCAB, [256]] # 10 (pas 256)
  #   ▲ SAUVEGARDÉ — features P5 après attention (branche super-res MB-FPN)
  #
  #   GLCAB reçoit UN SEUL tenseur (from=-1 = layer 9)
  #   Il produit un tenseur de MÊME forme via 3 branches :
  #     • L(P) : détail local  → Conv1×1 → Hardswish → Conv1×1 → BN
  #     • Z(P) : local branch  → Conv1×1 → Hardswish → Conv1×1 → BN
  #     • G(P) : global branch → GAP → Conv1×1 → BN → ReLU → Conv1×1 → BN
  #   Sortie : σ(L + Z) ⊗ G   (eq.5 du papier)
  #
  #   Pourquoi ici ? Le GLCAB est placé après SPPF pour enrichir les features
  #   profondes avec une attention combinée globale+locale AVANT la fusion FPN.
  #   Cela résout le problème de "missed detection" des petits objects.

# ══════════════════════════════════════════════════════════════════════════════
# HEAD  —  neck FPN + têtes de détection
# ══════════════════════════════════════════════════════════════════════════════

head:
  # ┌─────────────────────────────────────────────────────────────────────────┐
  # │  MB-FPN  —  Multi-Branch Feature Pyramid Network                       │
  # │                                                                         │
  # │  PRINCIPE : au lieu de fusionner des features de tailles différentes   │
  # │  par up-sampling (ce qui crée des pseudo-informations), MB-FPN fusionne│
  # │  des features DE MÊME TAILLE issues de deux branches parallèles.       │
  # │                                                                         │
  # │  Notation du papier :                                                   │
  # │    Branche principale  : P1..P5  (features backbone profondes)         │
  # │    Branche super-res   : x1..x5  (features backbone peu profondes)     │
  # │                                                                         │
  # │  Mapping sur NOTRE modèle :                                             │
  # │  ┌────────┬───────┬──────────┬───────────────────────────────────────┐ │
  # │  │ Entrée │ Layer │ Canaux   │ Description                           │ │
  # │  ├────────┼───────┼──────────┼───────────────────────────────────────┤ │
  # │  │ x[0]   │   4   │  512     │ P3 main  (80×80, shallow)             │ │
  # │  │ x[1]   │   6   │  512     │ P4 main  (40×40, shallow)             │ │
  # │  │ x[2]   │   9   │ 1024     │ P5 main  (20×20, SPPF deep)           │ │
  # │  │ x[3]   │  10   │ 1024     │ P5 GL-CAB (20×20, attention deep)     │ │
  # │  │ x[4]   │   8   │ 1024     │ P5 raw   (20×20, avant SPPF)          │ │
  # │  │ x[5]   │   2   │  256     │ x1 branch (160×160, très shallow)     │ │
  # │  │ x[6]   │   4   │  512     │ x2 branch (80×80, shallow)            │ │
  # │  │ x[7]   │   6   │  512     │ x3 branch (40×40, shallow)            │ │
  # │  │ x[8]   │   9   │ 1024     │ x4 branch (20×20, SPPF)               │ │
  # │  │ x[9]   │  10   │ 1024     │ x5 branch (20×20, GL-CAB)             │ │
  # │  └────────┴───────┴──────────┴───────────────────────────────────────┘ │
  # │                                                                         │
  # │  Fusion eq.(1) du papier :                                              │
  # │    P1* = P1                                                             │
  # │    P2* = Conv3×3(x1 ⊕ P1)                                              │
  # │    P3* = GL-CAB(P3)         ← GL-CAB interne au MB-FPN                 │
  # │    P4* = Conv3×3(x3 ⊕ P3*)                                             │
  # │    P5* = Conv3×3(x4 ⊕ P4) ⊕ P5                                        │
  # │                                                                         │
  # │  Sortie : liste [P1*, P2*, P3*, P4*, P5*] tous à 256 canaux            │
  # └─────────────────────────────────────────────────────────────────────────┘

  - [[4, 6, 9, 10, 8, 2, 4, 6, 9, 10], 1, MBFPN, [[128, 128, 256, 256, 256, 256, 128, 512, 256, 256], 256, True, False]]
  #  args[0] = liste des 10 canaux d'entrée (dans l'ordre du 'from')
  #  args[1] = 256  → out_channels (c2 dans tasks.py)
  #  args[2] = True → utiliser GL-CAB interne
  #  args[3] = False → return_all

  # ── Neck FPN standard — chemin montant (upsample) ─────────────────────────
  #
  #  On utilize les sorties de MB-FPN pour construire le neck.
  #  MB-FPN retourne une liste → on indexe avec [-1] pour avoir le premier
  #  élément (P1* = features P3 80×80 enrichies).

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 12  upsample P1* (80→160)
  - [[-1, 6], 1, Concat, [1]] # 13  concat avec P4 backbone
  - [-1, 2, C3k2, [512, False]] # 14  fusion P4

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 15  upsample (40→80)
  - [[-1, 4], 1, Concat, [1]] # 16  concat avec P3 backbone
  - [-1, 2, C3k2, [256, False]] # 17  P3/8 — petits objects ★

  # ── Neck FPN — chemin descendant (downsample) ─────────────────────────────

  - [-1, 1, Conv, [256, 3, 2]] # 18  stride 2 (80→40)
  - [[-1, 14], 1, Concat, [1]] # 19  concat avec features P4
  - [-1, 2, C3k2, [512, False]] # 20  P4/16 — objects moyens ★

  - [-1, 1, Conv, [512, 3, 2]] # 21  stride 2 (40→20)
  - [[-1, 11], 1, Concat, [1]] # 22  concat avec MB-FPN out
  - [-1, 2, C3k2, [1024, True]] # 23  P5/32 — grands objects ★

  # ── Têtes de détection ────────────────────────────────────────────────────
  - [[17, 20, 23], 1, Detect, [nc]] # 24  Detect(P3, P4, P5)
  #   17 = P3/8  → détecte les petits objects    (stride  8, résolution 80×80)
  #   20 = P4/16 → détecte les objects moyens    (stride 16, résolution 40×40)
  #   23 = P5/32 → détecte les grands objects    (stride 32, résolution 20×20)
