# YOLO11s-UAV — Mi et al., J. Imaging 2026, 12, 69
# DOI: 10.3390/jimaging12020069
#
# Modifications vs YOLO11s :
#   1. S2DResConv  remplace Conv stride-2 dans le backbone (3 couches)
#   2. FlexSimAM   remplace tous les C3k2 (backbone + neck)
#   3. CARAFEFast  remplace nn.Upsample dans le neck (CARIFPN)
#   4. Skip connections backbone→neck depuis P3 (couche 4)
#   5. 4 downsampling backbone (une couche de moins que YOLO11)
#
# Scheme 3 du papier (Table 5) :
#   c3k=True  : layers neck 12, 16, 19, 22 (attention renforcée)
#   c3k=False : layers backbone 2, 4 (léger)

nc: 80
scales:
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

# ── Backbone (4 downsampling) ─────────────────────────────────────────────────
backbone:
  - [-1, 1, Conv,       [64, 3, 2]]            # 0  P1/2   640→320
  - [-1, 1, Conv,       [128, 3, 2]]           # 1  P2/4   320→160
  - [-1, 2, FlexSimAM,  [256, False, 0.25]]    # 2        c3k=False
  - [-1, 1, S2DResConv, [256]]                 # 3  P3/8   160→80
  - [-1, 2, FlexSimAM,  [512, False, 0.25]]    # 4        c3k=False
  - [-1, 1, S2DResConv, [512]]                 # 5  P4/16   80→40
  - [-1, 2, FlexSimAM,  [512, True]]           # 6        c3k=False backbone
  - [-1, 1, S2DResConv, [1024]]                # 7  P5/32   40→20
  - [-1, 2, FlexSimAM,  [1024, True]]          # 8
  - [-1, 1, SPPF,       [1024, 5]]             # 9
  - [-1, 2, C2PSA,      [1024]]                # 10

# ── Neck (CARIFPN) ────────────────────────────────────────────────────────────
head:
  # ── Top-down P4 ────────────────────────────────────────────────────────────
  - [-1,  1, CARAFEFast, []]                    # 11  upsample P5→P4 scale (×2)
  - [[-1, 6], 1, Concat, [1]]                   # 12  cat backbone P4
  - [-1,  2, FlexSimAM,  [512, True]]           # 13  c3k=True neck

  # ── Top-down P3 ────────────────────────────────────────────────────────────
  - [-1,  1, CARAFEFast, []]                    # 14  upsample P4→P3 scale (×2)

  # Skip connection depuis backbone P3 (couche 4) — même résolution P3
  - [4,   1, Conv,       [256, 3, 1]]           # 15  skip 3×3 stride=1 (pas de downsampling)
  - [15,  1, Conv,       [256, 1, 1]]           # 16  skip 1×1 channel adjust

  - [[-1, 14, 4], 1, Concat, [1]]              # 17  cat: skip + top-down + backbone P3
  - [-1,  2, FlexSimAM,  [256, True]]           # 18  c3k=True neck P3

  # ── Bottom-up P4 ───────────────────────────────────────────────────────────
  - [-1,  1, Conv,       [256, 3, 2]]           # 19  stride=2 → P4
  - [[-1, 13], 1, Concat, [1]]                  # 20  cat head P4
  - [-1,  2, FlexSimAM,  [512, True]]           # 21  c3k=True neck P4

  # ── Bottom-up P5 ───────────────────────────────────────────────────────────
  - [-1,  1, Conv,       [512, 3, 2]]           # 22  stride=2 → P5
  - [[-1, 10], 1, Concat, [1]]                  # 23  cat head P5
  - [-1,  2, FlexSimAM,  [1024, True]]          # 24  c3k=True neck P5

  # ── Detection head ─────────────────────────────────────────────────────────
  - [[18, 21, 24], 1, Detect, [nc]]             # 25  P3, P4, P5