# yolo12-adapt.yaml — remplace A2C2f par AdaptA2C2f
backbone:
  - [-1, 1, Conv,        [64, 3, 2]]
  - [-1, 1, Conv,        [128, 3, 2]]
  - [-1, 2, C3k2,        [256, False, 0.25]]
  - [-1, 1, SPDConv,     [256]]               # SPDConv sur P3
  - [-1, 2, C3k2,        [512, False, 0.25]]
  - [-1, 1, Conv,        [512, 3, 2]]
  - [-1, 4, AdaptA2C2f,  [512, True, 4]]      # area adaptatif P4
  - [-1, 1, Conv,        [1024, 3, 2]]
  - [-1, 4, AdaptA2C2f,  [1024, True, 1]]     # area adaptatif P5

head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]]
  - [-1, 2, AdaptA2C2f, [512, False, -1]]     # area adaptatif neck P4

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]]
  - [-1, 2, AdaptA2C2f, [256, False, -1]]     # area adaptatif neck P3

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 11], 1, Concat, [1]]
  - [-1, 2, AdaptA2C2f, [512, False, -1]]

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 8], 1, Concat, [1]]
  - [-1, 2, C3k2, [1024, True]]

  - [[14, 17, 20], 1, Detect, [nc]]