# yolo12-spd-glcab.yaml
# ──────────────────────────────────────────────────────────────────
# SPDConv  → remplace Conv stride-2 sur P3, P4, P5 (couches 3, 5, 7)
# C2f_GLCAB → remplace C3k2 sur P3 (couche 4) et A2C2f dans le neck
# P5 (couche 20) conserve C3k2 — les grands objets n'ont pas besoin
# de l'attention local+global du GL-CAB
# ──────────────────────────────────────────────────────────────────
nc: 80
scales:
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

backbone:
  - [-1, 1, Conv,       [64, 3, 2]]            # 0-P1/2  Conv classique (image RGB)
  - [-1, 1, Conv,       [128, 3, 2]]           # 1-P2/4  Conv classique (image RGB)
  - [-1, 2, C3k2,       [256, False, 0.25]]    # 2       C3k2 conservé
  - [-1, 1, SPDConv,    [256]]                 # 3-P3/8  ← SPDConv (était Conv 256,3,2)
  - [-1, 2, C2f_GLCAB,  [512, False, 0.25]]    # 4       ← GL-CAB  (était C3k2)
  - [-1, 1, SPDConv,    [512]]                 # 5-P4/16 ← SPDConv (était Conv 512,3,2)
  - [-1, 4, A2C2f,      [512, True, 4]]        # 6       A2C2f conservé
  - [-1, 1, SPDConv,    [1024]]                # 7-P5/32 ← SPDConv (était Conv 1024,3,2)
  - [-1, 4, A2C2f,      [1024, True, 1]]       # 8       A2C2f conservé

head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 9
  - [[-1, 6], 1, Concat, [1]]                  # 10  cat backbone P4
  - [-1, 2, C2f_GLCAB,  [512, False, 0.25]]    # 11  ← GL-CAB neck P4

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 12
  - [[-1, 4], 1, Concat, [1]]                  # 13  cat backbone P3
  - [-1, 2, C2f_GLCAB,  [256, False, 0.25]]    # 14  ← GL-CAB neck P3 (petits objets)

  - [-1, 1, Conv,        [256, 3, 2]]          # 15
  - [[-1, 11], 1, Concat, [1]]                 # 16  cat neck P4
  - [-1, 2, C2f_GLCAB,  [512, False, 0.25]]    # 17  ← GL-CAB neck P4

  - [-1, 1, Conv,        [512, 3, 2]]          # 18
  - [[-1, 8], 1, Concat, [1]]                  # 19  cat backbone P5
  - [-1, 2, C3k2,        [1024, True]]         # 20  C3k2 conservé pour P5

  - [[14, 17, 20], 1, Detect, [nc]]            # Detect P3/P4/P5