# yolo12-spd.yaml
nc: 80
scales:
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

backbone:
  - [-1, 1, Conv,    [64, 3, 2]]          # 0-P1/2   Conv classique
  - [-1, 1, Conv,    [128, 3, 2]]         # 1-P2/4   Conv classique
  - [-1, 2, C3k2,    [256, False, 0.25]]  # 2
  - [-1, 1, SPDConv, [256]]               # 3-P3/8   ← remplace Conv 256,3,2
  - [-1, 2, C3k2,    [512, False, 0.25]]  # 4
  - [-1, 1, SPDConv, [512]]               # 5-P4/16  ← remplace Conv 512,3,2
  - [-1, 4, A2C2f,   [512, True, 4]]      # 6
  - [-1, 1, SPDConv, [1024]]              # 7-P5/32  ← remplace Conv 1024,3,2
  - [-1, 4, A2C2f,   [1024, True, 1]]     # 8

head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]]
  - [-1, 2, A2C2f, [512, False, -1]]      # 11

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]]
  - [-1, 2, A2C2f, [256, False, -1]]      # 14

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 11], 1, Concat, [1]]
  - [-1, 2, A2C2f, [512, False, -1]]      # 17

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 8], 1, Concat, [1]]
  - [-1, 2, C3k2, [1024, True]]           # 20

  - [[14, 17, 20], 1, Detect, [nc]]